Revit 2023 API
ReinforcementSettings.RebarShapeDefinesHooks Property
 Hooks are defined by Rebar Shape of Rebar element. Can be changed if document contains no rebars, area reinforcements and path reinforcements.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2014
Syntax
C#
public bool RebarShapeDefinesHooks { get; set; }
Visual Basic
Public Property RebarShapeDefinesHooks As Boolean
	Get
	Set
Visual C++
public:
property bool RebarShapeDefinesHooks {
	bool get ();
	void set (bool value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.DisabledDisciplineException |  When setting this property: None of the following disciplines is enabled: Structural.
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: Cannot change the RebarShapeDefinesHooks property in these settings because the document contains one or more Rebar elements. -or- When setting this property: Cannot change the RebarShapeDefinesHooks property in these settings because the document contains one or more AreaReinforcement or PathReinforcement elements. -or- When setting this property: Cannot change the RebarShapeDefinesHooks property in these settings because the document contains one or more RebarContainer elements. the document contains one or more RebarContainer elements.
See Also
ReinforcementSettings Class
Autodesk.Revit.DB.Structure Namespace